# Реализовать функцию my_func(), которая принимает
# три позиционных аргумента и возвращает сумму наибольших
# двух аргументов
def int_func(x, y, z):
    a = x+y
    b = y+z
    if a > b:
        x+y
        return a
    else:
        y+z
    return b
print (int_func(20, 10, 30))

